app/views/authors/show.html.erb

SELECT `phones`.* FROM `phones` WHERE `phones`.`author_id` = 1
---
<p>Name: <%= @author.name %></p>
<% @author.phones.each do |phone| %>