app/controllers/authors_controller.rb

SELECT `authors`.* FROM `authors`
---
def index
  @authors = Author.all

INSERT INTO `authors` (`name`) VALUES (?)  [["name", "jaya"]]
---
def create
  @author = Author.new(params[:author])
  if @author.save

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = ? LIMIT 1  [["id", "3"]]
---
def edit
  @author = Author.find(params[:id])

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = ? LIMIT 1  [["id", "3"]]
UPDATE `authors` SET `name` = 'Cee' WHERE `authors`.`id` = 3
---
def update
  @author = Author.find(params[:id])
  if @author.update_attributes(params[:author])

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = ? LIMIT 1  [["id", "3"]]
---
def show
  @author = Author.find(params[:id])