app/controllers/books_controller.rb

SELECT `books`.* FROM `books`
---
  def index
    @books = Book.all

SELECT `books`.* FROM `books` WHERE `books`.`id` = ? LIMIT 1  [["id", "1"]]
---
  def show
    @book = Book.find(params[:id])

SELECT `books`.* FROM `books` WHERE `books`.`id` = ? LIMIT 1  [["id", "6"]]
---
  def edit
    @book = Book.find(params[:id])

INSERT INTO `books` (`author`, `created_at`, `title`, `updated_at`) VALUES (?, ?, ?, ?)  [["author", "Ragvendra"], ["created_at", Sun, 12 May 2013 13:13:56 UTC +00:00], ["title", "Lets Us Lear C"], ["updated_at", Sun, 12 May 2013 13:13:56 UTC +00:00]]
---
  def create
    @book = Book.new(params[:book])
    respond_to do |format|
      if @book.save

SELECT `books`.* FROM `books` WHERE `books`.`id` = ? LIMIT 1  [["id", "6"]]
UPDATE `books` SET `title` = 'adaa1', `author_id` = 13, `updated_at` = '2013-05-18 01:52:08' WHERE `books`.`id` = 8
---
  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])

SELECT `books`.* FROM `books` WHERE `books`.`id` = ? LIMIT 1  [["id", "12"]]
DELETE FROM `books` WHERE `books`.`id` = ?  [["id", 12]]
---
  def destroy
    @book = Book.find(params[:id])
    @book.destroy